{"project":{"projectId":14429,"title":"Unsteady Computation of the Plasma of Nested-Channel Hall Thrusters","primaryTaxonomyNodes":[{"taxonomyNodeId":10544,"taxonomyRootId":8816,"parentNodeId":10542,"level":3,"code":"TX01.2.2","title":"Electrostatic","definition":"This area covers electric propulsion systems that use electrostatic fields to ionize and accelerate a propellant.","exampleTechnologies":"Ion engines, hall thrusters, electrospray propulsion","hasChildren":false,"hasInteriorContent":true}],"startTrl":2,"currentTrl":3,"endTrl":3,"benefits":"Most EP systems in use today provide very low values of thrust. Hence high-power EP is desirable for NEO and Mars missions. Currently (single channel) Hall thrusters provide the highest value of thrust while consuming a reasonable amount of electric power, out of all EP systems. Recent developments have shown that using a Hall thruster with multiple channels (as opposed to multiple single channel thrusters) may provide increases in efficiency and also versatility of the design. My goal is to create a numerical model for such a device and simulate its operation and the plume that the thruster generates. We aim to verify the expected increases in efficiency.","description":"Since the dawn of mankind scientific discoveries have improved our way of living, understanding of the world around us and understanding of ourselves. Significant scientific and technological leaps were made during the Space Race since the planned space missions required the development of certain enabling technologies (mission pull). Similar requirements arise today as well.  Two types of space missions of interest for the near future (2020-2030) would be visiting Near Earth Objects (NEO) and sending cargo to Mars. The first type of mission can be seen as an exploratory voyage which may provide valuable information about asteroids, in the short run. But in the long-run such missions will provide us with the background and experience necessary to neutralize the threat that such objects may pose if their trajectories were ever to intersect Earth's orbit. The ability to send cargo to Mars is vital for the continual exploration of this planet and potential establishment of a human outpost. The advantages of having humans on the surface of Mars span form the purely scientific purpose of having scientists examining samples in a lab that is on-site to the purely exploratory goal of establishing a new launch base for future missions on other planets and deep space.  The two missions described above and presented in the NASA In-space Propulsion Technology Area Strategic Roadmap from 2012 are both possible with present day technology, but at prohibitively high costs. In order to achieve these goals with reasonable budgets more efficient propulsion technologies must be developed. For this reason electric propulsion (EP), an intrinsically more efficient propulsion method is an ideal choice. However, most EP systems in use today provide very low values of thrust. Hence high-power EP is desirable for NEO and Mars missions. Currently (single channel) Hall thrusters provide the highest value of thrust while consuming a reasonable amount of electric power, out of all EP systems. Recent developments have shown that using a Hall thruster with multiple channels (as opposed to multiple single channel thrusters) may provide increases in efficiency and also versatility of the design. My goal is to create a numerical model for such a device and simulate its operation and the plume that the thruster generates. I wish to verify the expected increases in efficiency.  The motivation for developing a simulation comes from three sources. First, the cost is much lower than testing a nested-channel Hall thruster in a laboratory. Operating a vacuum chamber is expensive and the fuel that the Hall thruster uses is Xenon which in itself is very expensive.  The second reason is that with a computer simulation the researcher can effectively control the physics. This means that certain experiments that might be impossible in a laboratory can be performed in the simulation environment. Finally, observations can be made more precisely within the simulation, whereas in the laboratory test certain measurements may not be possible. However the laboratory experiments are still very important since the computer codes must be validated by measured data to ensure that the simulation is accurate.  I will create my thruster model by expanding an existing code, HPHall. For the plume analysis I will be expanding a code that is being developed in the Non-equilibrium Gas and Plasma Dynamics Laboratory at the University of Michigan:  MPIC. I will then be using the HPHall code to determine the properties of the thruster near-field and then use them as input for the MONACO simulation which will generate values for the plasma properties in the far-field plume. The code development effort will require the use of adaptive parallel computation techniques. Upon completion, the results obtained from the extended versions of HPHall and MPIC will be validated by experimental laboratory results.","destinations":[{"lkuCodeId":1546,"code":"INSIDE_SOLAR_SYSTEM","description":"Others Inside the Solar System","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}},{"lkuCodeId":1548,"code":"FOUNDATIONAL_KNOWLEDGE","description":"Foundational Knowledge","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}},{"lkuCodeId":1518,"code":"MARS","description":"Mars","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}}],"startYear":2013,"startMonth":9,"endYear":2017,"endMonth":9,"statusDescription":"Completed","principalInvestigators":[{"contactId":505235,"firstName":"Iain","lastName":"Boyd","fullName":"Iain D Boyd","fullNameInverted":"Boyd, Iain D","middleInitial":"D","primaryEmail":"iainboyd@umich.edu","publicEmail":false,"nacontact":false}],"programDirectors":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programExecutives":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programManagers":[{"contactId":183514,"firstName":"Hung","lastName":"Nguyen","fullName":"Hung D Nguyen","fullNameInverted":"Nguyen, Hung D","middleInitial":"D","primaryEmail":"hung.d.nguyen@nasa.gov","publicEmail":true,"nacontact":false}],"coInvestigators":[{"contactId":182191,"firstName":"Horatiu","lastName":"Dragnea","fullName":"Horatiu C Dragnea","fullNameInverted":"Dragnea, Horatiu C","middleInitial":"C","primaryEmail":"horatiu.dragnea@jpl.nasa.gov","publicEmail":true,"nacontact":false}],"website":"https://www.nasa.gov/directorates/spacetech/home/index.html","libraryItems":[],"transitions":[],"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"program":{"acronym":"STRG","active":true,"description":"<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ","programId":69,"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"responsibleMdId":4875,"stockImageFileId":36658,"title":"Space Technology Research Grants"},"leadOrganization":{"canUserEdit":false,"city":"Ann Arbor","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":2900,"organizationName":"University of Michigan-Ann Arbor","organizationType":"Academia","stateTerritory":{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34},"stateTerritoryId":34,"murepUnitId":170976,"naorganization":false,"organizationTypePretty":"Academia"},"statesWithWork":[{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34}],"lastUpdated":"2018-10-10","releaseStatusString":"Released","endDateString":"Sep 2017","startDateString":"Sep 2013"}}