{"project":{"projectId":88449,"title":"Understanding newly discovered oscillation modes in magnetically shielded Hall thrusters utilizing state of the art high speed diagnostics","primaryTaxonomyNodes":[{"taxonomyNodeId":10544,"taxonomyRootId":8816,"parentNodeId":10542,"level":3,"code":"TX01.2.2","title":"Electrostatic","definition":"This area covers electric propulsion systems that use electrostatic fields to ionize and accelerate a propellant.","exampleTechnologies":"Ion engines, hall thrusters, electrospray propulsion","hasChildren":false,"hasInteriorContent":true}],"startTrl":2,"currentTrl":2,"endTrl":3,"benefits":"Understanding and characterizing these instabilities is vital if NASA is to advance HET design for very long life and high Isp missions.","description":"I propose to investigate the newly discovered oscillation modes specific to Magnetically Shied (MS) Hall Effect Thrusters (HET). Although HETs are classified as a Stationary Plasma Thruster (SPT), their behavior is quite dynamic once viewed under high speed time resolved diagnostics. They appear to have unstable oscillations and mode transitions that occur during a variety of operating conditions. The oscillation modes that existed in conventional unshielded (US) thrusters have been the subject of considerable research and have led to a greater understanding of the HETs dynamic behavior. For example, the US HET breathing mode has been studied using a novel High Speed Dual Langmuir probe (HDLP) and FASTCAM technology by the University of Michigan's Plasmadynamics and Electric Propulsion Laboratory (PEPL) and NASAs GRC of Cleveland Ohio (GRC). These studies have led to advances in HET Isp, efficiency, and service lifetime.  With the recent development of magnetically shielded HETs arises new physics that remain uncovered. MS HETs use modified channel geometry and a specialized magnetic fields to nearly eliminate erosion. However, this causes the MS HETs to behave differently and form unique oscillation modes. Recent studies performed on the 300MS-2 and H6MS HETs have revealed behavior inconsistent with US HETs. This behavior includes the presence of new mode transitions and the absence of spokes which consistently appears in US thrusters under higher magnetic field densities. Understanding and characterizing these instabilities is vital if NASA is to advance HET design for very long life and high Isp missions.  In order to gain this understanding, I intend to develop and use state of the art high-speed diagnostic systems at GRC. GRC houses the12-kW MS HERMeS HET, the vacuum facilities, and the actively researching HET experts necessary to complete this research. In addition to GRC, I will collaborate with University of Michigan's PEPL laboratory.  By the end of my research I hope to answer the following questions:  Does the spoke instability mode exist in MS HETs?  If not, why doesn't spoke mode exist?  Are there other oscillation modes unique to MS HETs?  How do the oscillation modes affect thruster performance and operation?  How do thruster operating parameters affect oscillation modes in MS HETs?   Past studies performed on US HETs have indicated that some oscillation modes either contribute to or are necessary for proper operation. I hypothesize that the same is true for MS HETs and intend to study how this mechanism works. I've also hypothesized that spoke-like instabilities are capable within any MS HET and that the spoke mode may only appear under specific operating conditions.  NASA Technology Roadmap Technology Area 2 (TA-2) for In-Space Propulsion states that NASA's objective is to have an HET with the capability of delivering heavy payloads on 5 km/s delta-V missions. The TA-2 goals outline the need for HETs with lifetimes greater than 50,000 hours, Isp's ranging from 2,000 to 3,000 seconds, and a maximum power of 10 kW. NASA's Asteroid Redirect Robotic Mission (ARRM), currently in development serves as an example of how HETs will be used in the future. The goal of the ARRM mission would be to rendezvous with a near Earth asteroid, capture it, and deliver it to lunar orbit for study. The ARRM mission would necessitate an HET with an Isp in excess of 3000 seconds and propellant mass of 10,000 kg. An array of these HETs would allow a spacecraft to have a solar range of 1.9 AU. The the12-kW MS Hall Effect Rocket with Magnetic Shielding (HERMeS) at NASA GRC (GRC) has been designed to fulfill this need.  Upon uncovering of the newly discovered oscillation modes using state of the art high-speed diagnostics, I will publish my results and disseminate. This effort will contribute to more MS HET understanding and advances in HET life, efficiency, and thrust.","destinations":[{"lkuCodeId":1545,"code":"THE_SUN","description":"The Sun","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}},{"lkuCodeId":1547,"code":"OUTSIDE_SOLAR_SYSTEM","description":"Outside the Solar System","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}}],"startYear":2016,"startMonth":8,"endYear":2020,"endMonth":7,"statusDescription":"Completed","principalInvestigators":[{"contactId":279509,"firstName":"Kristina","lastName":"Lemmer","fullName":"Kristina M Lemmer","fullNameInverted":"Lemmer, Kristina M","middleInitial":"M","publicEmail":false,"nacontact":false}],"programDirectors":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programExecutives":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programManagers":[{"contactId":183514,"firstName":"Hung","lastName":"Nguyen","fullName":"Hung D Nguyen","fullNameInverted":"Nguyen, Hung D","middleInitial":"D","primaryEmail":"hung.d.nguyen@nasa.gov","publicEmail":true,"nacontact":false}],"coInvestigators":[{"contactId":320514,"firstName":"Matthew","lastName":"Baird","fullName":"Matthew J Baird","fullNameInverted":"Baird, Matthew J","middleInitial":"J","primaryEmail":"matthew.j.baird@nasa.gov","publicEmail":true,"nacontact":false}],"website":"https://www.nasa.gov/strg#.VQb6T0jJzyE","libraryItems":[],"transitions":[],"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"program":{"acronym":"STRG","active":true,"description":"<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ","programId":69,"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"responsibleMdId":4875,"stockImageFileId":36658,"title":"Space Technology Research Grants"},"leadOrganization":{"canUserEdit":false,"city":"Kalamazoo","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":1042,"organizationName":"Western Michigan University","organizationType":"Academia","stateTerritory":{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34},"stateTerritoryId":34,"murepUnitId":172699,"naorganization":false,"organizationTypePretty":"Academia"},"supportingOrganizations":[{"acronym":"GRC","canUserEdit":false,"city":"Cleveland","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":false,"linkCount":0,"organizationId":4860,"organizationName":"Glenn Research Center","organizationType":"NASA_Center","stateTerritory":{"abbreviation":"OH","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Ohio","stateTerritoryId":23},"stateTerritoryId":23,"naorganization":false,"organizationTypePretty":"NASA Center"}],"statesWithWork":[{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34}],"lastUpdated":"2020-5-1","releaseStatusString":"Released","endDateString":"Jul 2020","startDateString":"Aug 2016"}}