{"project":{"projectId":91178,"title":"Long Life Miniature Hall Thruster Enabling Low Cost Human Precursor Missions","primaryTaxonomyNodes":[{"taxonomyNodeId":10544,"taxonomyRootId":8816,"parentNodeId":10542,"level":3,"code":"TX01.2.2","title":"Electrostatic","definition":"This area covers electric propulsion systems that use electrostatic fields to ionize and accelerate a propellant.","exampleTechnologies":"Ion engines, hall thrusters, electrospray propulsion","hasChildren":false,"hasInteriorContent":true}],"startTrl":2,"currentTrl":3,"endTrl":3,"benefits":"This novel miniature Hall thruster will enable low cost deep space human precursor missions to near Earth asteroids (NEAs), near Earth objects (NEOs), and nearby planets. As discussed in the NASA In-Space Propulsion System Roadmap Section 2.2.1.2.2, the development of high-power Hall thrusters with longer operational lifetimes is necessary for human missions throughout the solar system. Before such missions can occur, however, precursor missions involving low cost miniature spacecraft must survey the target NEA, NEO, or planet to mitigate the risks of deep space human travel. Employing long life, high efficiency miniature Hall thrusters on such precursor spacecraft will enable shorter mission times due to the increased thrust (compared to ion thrusters) while maintaining the high propellant efficiency common to electric propulsion devices.","description":"Key and Central Objectives: This investigation aims to demonstrate that the application of magnetic shielding technology on miniature Hall thrusters will dramatically improve the operational life of these devices while improving total efficiency and performance. By applying magnetically shielded field topography to a custom-built miniature Hall thruster, we will show that erosion and localized heating problems are eliminated when compared to a non-shielded design. This will allow the device to operate at its optimum discharge voltage without the negative effects of discharge channel erosion or high-energy electron power deposition, thereby increasing operational life, increasing total efficiency, and improving thruster performance.  Significance of Objectives: This novel miniature Hall thruster will enable low cost deep space human precursor missions to near Earth asteroids (NEAs), near Earth objects (NEOs), and nearby planets. As discussed in the NASA In-Space Propulsion System Roadmap Section 2.2.1.2.2, the development of high-power Hall thrusters with longer operational lifetimes is necessary for human missions throughout the solar system. Before such missions can occur, however, precursor missions involving low cost miniature spacecraft must survey the target NEA, NEO, or planet to mitigate the risks of deep space human travel. Employing long life, high efficiency miniature Hall thrusters on such precursor spacecraft will enable shorter mission times due to the increased thrust (compared to ion thrusters) while maintaining the high propellant efficiency common to electric propulsion devices.   Proposed Method/Techniques: This effort will combine experimental and computational approaches to determine an efficient and robust thruster design. Initial modeling efforts will be used before testing to design the thruster's magnetic circuit, feed system, and plasma channel. Models will also be used throughout the testing and post-test analysis to assess thruster performance and associated plasma behavior. The experimental aspect of this investigation requires the construction of two nearly identical miniature Hall thrusters. The first custom thruster will be built using conventional Hall thruster designs (purely radial magnetic field near the thruster channel exit). This thruster will be rigorously tested and all of its performance and efficiency data will be recorded. These data are expected to be on the same order of the performance and efficiency of the state-of-the-art BHT-200 and will be the control for this experiment. The second thruster will employ magnetically shielded field topography for a miniature thruster based on the design principles discussed by Hofer and Mikellides, et al. This device will be tested in the same way as the first thruster to provide a direct comparison of performance and efficiency. All experiments are to be carried out in the newly constructed Pi Facility vacuum chamber (5’ diameter x 9’ length) at UCLA, capable of 5e-7 Torr base pressure. A direct comparison of the data from the two test thrusters will demonstrate the benefits of magnetic shielding ’in miniature Hall thrusters. The physical mechanisms responsible for the improvements in performance due to shielding will be illuminated and explained by plasma diagnostics data. Successful completion of this investigation will result in demonstrating the elimination of discharge channel wall erosion as a life limiting factor for miniature Hall thrusters along with improved performance and efficiency through the application of the magnetic shielding techniques.","startYear":2013,"startMonth":8,"endYear":2016,"endMonth":1,"statusDescription":"Completed","principalInvestigators":[{"contactId":395313,"firstName":"Richard","lastName":"Wirz","fullName":"Richard E Wirz","fullNameInverted":"Wirz, Richard E","middleInitial":"E","primaryEmail":"wirz@ucla.edu","publicEmail":false,"nacontact":false}],"programDirectors":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programExecutives":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programManagers":[{"contactId":183514,"firstName":"Hung","lastName":"Nguyen","fullName":"Hung D Nguyen","fullNameInverted":"Nguyen, Hung D","middleInitial":"D","primaryEmail":"hung.d.nguyen@nasa.gov","publicEmail":true,"nacontact":false}],"coInvestigators":[{"contactId":417164,"firstName":"Ryan","lastName":"Conversano","fullName":"Ryan W Conversano","fullNameInverted":"Conversano, Ryan W","middleInitial":"W","primaryEmail":"ryan.w.conversano@jpl.nasa.gov","publicEmail":true,"nacontact":false}],"website":"https://www.nasa.gov/directorates/spacetech/home/index.html","libraryItems":[],"transitions":[],"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"program":{"acronym":"STRG","active":true,"description":"<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ","programId":69,"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"responsibleMdId":4875,"stockImageFileId":36658,"title":"Space Technology Research Grants"},"supportingOrganizations":[{"acronym":"Berkeley","canUserEdit":false,"city":"Berkeley","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":4340,"organizationName":"University of California-Berkeley","organizationType":"Academia","stateTerritory":{"abbreviation":"CA","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"California","stateTerritoryId":59},"stateTerritoryId":59,"murepUnitId":110635,"naorganization":false,"organizationTypePretty":"Academia"},{"acronym":"USC","canUserEdit":false,"city":"Los Angeles","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":816,"organizationName":"University of Southern California","organizationType":"Academia","stateTerritory":{"abbreviation":"CA","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"California","stateTerritoryId":59},"stateTerritoryId":59,"msiData":{"2017":["Asian American Native American Pacific Islander (AANAPISI)"]},"setAsideData":[],"murepUnitId":123961,"naorganization":false,"organizationTypePretty":"Academia"}],"statesWithWork":[{"abbreviation":"CA","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"California","stateTerritoryId":59}],"lastUpdated":"2018-10-10","releaseStatusString":"Released","endDateString":"Jan 2016","startDateString":"Aug 2013"}}