{"project":{"projectId":91463,"title":"Development of a Long-Life 50-kW Class Nested Hall Thruster","primaryTaxonomyNodes":[{"taxonomyNodeId":10544,"taxonomyRootId":8816,"parentNodeId":10542,"level":3,"code":"TX01.2.2","title":"Electrostatic","definition":"This area covers electric propulsion systems that use electrostatic fields to ionize and accelerate a propellant.","exampleTechnologies":"Ion engines, hall thrusters, electrospray propulsion","hasChildren":false,"hasInteriorContent":true}],"startTrl":2,"currentTrl":3,"endTrl":3,"benefits":"Mission analysis from NASA has shown that high power Hall thrusters are ideal for near- Earth and deep-space applications. In order to support the next generation of space missions, propulsion systems must be able to meet a variety of performance metrics. Nested-channel Hall thrusters allow for this by having a variety of firing configurations, and magnetic shielding allows for Hall thrusters to be used on deep space missions by increasing thruster lifetime. The x3 MS significantly increases the technology readiness level of Hall thrusters and moves NASA towards its goal of exploring the solar system.","description":"Proposed here is the development and testing of a long-life high-power Hall thruster. The thruster will be a 50-kW class nested-channel Hall thruster. The thruster will be designed based on a heritage of other thrusters, namely the H6MS and the X3. Both were jointly developed by the Plasmadynamics and Electric Propulsion Laboratory (PEPL) at the University of Michigan, NASA and the Air Force Office of Scientific Research. The X3 is currently undergoing a full performance characterization to gather thrust data and plume characteristics. This data will be used to develop a physics model of the thruster and investigate the interaction between channels in nested-channel Hall thrusters. The new thruster will be a two-channel magnetically-shielded thruster, ideally simulated on the physics model developed from X3. It will have a nominal power between 35 and 95 kW. New breakthroughs in life-prolonging technologies will be implemented on the thruster to enable a minimum lifetime of 10,000 hours. The development of the high power Hall thruster was a critical step forward in the field of electric propulsion and in NASA's plan to leverage them on a variety of missions, such as a manned mission to Mars. However, the technology cannot currently be used on deep space missions due to lifetime issues. Erosion is the main mechanism of failure on a Hall thruster, as once the wall thickness reaches a critical level, the magnetic circuit is exposed and shorted. The development of this thruster will mitigate this issue by significantly reducing, and ultimately stopping, the erosion of the channel. The project involves the design, fabrication, and testing of a two-channel magnetically shielded thruster. The main design changes from unshielded thrusters are the magnetic field and the chamfering of the isolation walls at thruster exit. These change allows for plasma potential near the walls equal to that of the discharge voltage, low electron energies near the wall and field lines that exit the thruster without intersecting the wall such that the ions are not accelerated into the walls. These aspects are the main requirements behind magnetic shielding of a Hall thruster. Once thruster design and fabrication is complete, testing will commence to assess performance and plasma characteristics. Measurements to estimate erosion rates will be performed to confirm that erosion has been dramatically decreased compared to conventional Hall thrusters. A suite of plasma diagnostics will be used to collect data on relevant plasma properties. These will then be used to calculate thruster efficiency and develop a physics model of the thruster similar to that of the X3 US. Additionally, thrust measurements will be taken to confirm that performance is on par with unshielded thrusters. The work proposed here has many implications on the field of electric propulsion. The project itself poses an unprecedented challenge as neither a high-power Hall thruster (50-kW class and above) nor a nested-channel Hall thruster has ever been magnetically shielded. Insight into magnetically shielding such a thruster has far reaching implications for future high-power Hall thrusters. Furthermore, NASA has particular interest in such a project, because it will fulfill the need for a cost-effective propulsion technology for human space exploration. In a recent Broad Agency Announcement, NASA called for a 50 to 300 kW thruster for a variety of missions with a lifetime of up to 10,000 hrs. Currently, this thruster is one of the few thrusters that can meet this demand in the proposed five-year time scale. Mission analysis from NASA has shown that high power Hall thrusters are ideal for near- Earth and deep-space applications. In order to support the next generation of space missions, propulsion systems must be able to meet a variety of performance metrics. Nested-channel Hall thrusters allow for this by having a variety of firing configurations, and magnetic shielding allows for Hall thrusters to be used on deep space missions by increasing thruster lifetime. A two-channel magnetically shielded Hall thruster significantly increases the technology readiness level of Hall thrusters and moves NASA towards its goal of exploring the solar system. ","destinations":[{"lkuCodeId":1545,"code":"THE_SUN","description":"The Sun","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}},{"lkuCodeId":1544,"code":"THE_MOON","description":"The Moon","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}}],"startYear":2015,"startMonth":8,"endYear":2019,"endMonth":9,"statusDescription":"Completed","principalInvestigators":[{"contactId":8134,"firstName":"Alec","lastName":"Gallimore","fullName":"Alec Gallimore","fullNameInverted":"Gallimore, Alec","primaryEmail":"rasta@umich.edu","publicEmail":false,"nacontact":false}],"programDirectors":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programExecutives":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programManagers":[{"contactId":183514,"firstName":"Hung","lastName":"Nguyen","fullName":"Hung D Nguyen","fullNameInverted":"Nguyen, Hung D","middleInitial":"D","primaryEmail":"hung.d.nguyen@nasa.gov","publicEmail":true,"nacontact":false}],"coInvestigators":[{"contactId":424200,"firstName":"Sarah","lastName":"Cusson","fullName":"Sarah Cusson","fullNameInverted":"Cusson, Sarah","primaryEmail":"cusson@umich.edu","publicEmail":false,"nacontact":false}],"website":"https://www.nasa.gov/strg#.VQb6T0jJzyE","libraryItems":[],"transitions":[],"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"program":{"acronym":"STRG","active":true,"description":"<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ","programId":69,"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"responsibleMdId":4875,"stockImageFileId":36658,"title":"Space Technology Research Grants"},"leadOrganization":{"canUserEdit":false,"city":"Ann Arbor","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":2900,"organizationName":"University of Michigan-Ann Arbor","organizationType":"Academia","stateTerritory":{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34},"stateTerritoryId":34,"murepUnitId":170976,"naorganization":false,"organizationTypePretty":"Academia"},"supportingOrganizations":[{"acronym":"JPL","canUserEdit":false,"city":"Pasadena","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":false,"linkCount":0,"organizationId":4946,"organizationName":"Jet Propulsion Laboratory","organizationType":"NASA_Center","stateTerritory":{"abbreviation":"CA","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"California","stateTerritoryId":59},"stateTerritoryId":59,"naorganization":false,"organizationTypePretty":"NASA Center"}],"statesWithWork":[{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34}],"lastUpdated":"2020-5-1","releaseStatusString":"Released","endDateString":"Sep 2019","startDateString":"Aug 2015"}}