{"project":{"projectId":91519,"title":"Physical Processes in High Current Hollow Cathodes","primaryTaxonomyNodes":[{"taxonomyNodeId":10544,"taxonomyRootId":8816,"parentNodeId":10542,"level":3,"code":"TX01.2.2","title":"Electrostatic","definition":"This area covers electric propulsion systems that use electrostatic fields to ionize and accelerate a propellant.","exampleTechnologies":"Ion engines, hall thrusters, electrospray propulsion","hasChildren":false,"hasInteriorContent":true}],"startTrl":2,"currentTrl":3,"endTrl":3,"benefits":"This will build a basis for understanding how cathode erosion will be affected when Hall thrusters are scaled towards the 1 MW goal. Significant progress can be made in our understanding of the underlying physics which drive cathode erosion. With this understanding of cathode physics, engineers can begin to develop predictive models for cathode-thruster interactions to design long-life Hall effect thrusters which meet NASA's space exploration goals.","description":"The next generation of space exploration missions, such as the asteroid return mission and the human exploration of Mars, are not feasible with the technology that currently exists. High power electric propulsion has been identified by the National Research Council (NRC) as a technology capable of providing both the power and efficiency required for NASA's robotic and manned missions. The Hall effect thruster is an in-space electric propulsion technology that is currently being considered for NASA's asteroid retrieval mission and for manned missions to Mars. By the NRC's recommendation, NASA should focus its Hall thruster research into three target areas to achieve a Technology Readiness Level of 6. The first objective is to scale the thrusters to produce 1 MW of power. Second, the interaction between plasma plume and the rest of the spacecraft should be characterized to identify potentially adverse effects. Finally, research should concentrate on improving thruster lifetime and minimizing erosion.    This proposal aims to address the lifetime and erosion of hollow cathodes in Hall thrusters. In particular, the proposed research focuses on understanding the physical phenomena which drive erosion processes and how they scale with cathode power, thruster power, and magnetic field topology. To accomplish this, the primary diagnostics will be time resolved laser induced fluorescence (TRLIF), a retarded potential analyzer (RPA) and high-speed dual Langmuir probes (HDLP). TRLIF measures the velocity distribution function as a function of time, the HDLP measures the plasma density, electron temperature, and plasma potential in the time domain, and the RPA measures the time averaged ion energy. Using these plasma diagnostics, four research phases are proposed.     The first set of experiments makes time resolved measurements of near-cathode plasma properties. This set up places an anode downstream of a high-current cathode and uses TRLIF, the RPA and HDLP to make near-cathode plasma measurements. These experiments will quantify how the physical phenomena which drive cathode erosion, such as ion acoustic turbulence depend on the cathode's discharge current and gas flow-rate. The next series of tests will place the cathode in a Hall thruster's magnetic field (without firing the thruster) with an anode downstream. In this phase, the strength of the magnetic field will be varied without changing the magnetic field topology. Using the plasma diagnostics, the influence of magnetic field strength on the time evolution of the erosion processes will be determined. Additionally, non-uniformities in the magnetic field will be induced to determine their effect on instabilities in the cathode plasma. The third phase investigates the effect of changing the magnetic field topology on cathode erosion. This is done by changing the thruster from a single channel thruster to a multichannel thruster. This test will establish how near-cathode physics change as the thruster design is scaled. Lastly, our time resolved plasma measurements will be made on a fully activated thruster. Comparing this data set with our previous results, we will be able to determine the effect of the thruster's plasma on the plasma properties near the cathode.    In conclusion, this proposal leverages a new time resolved laser induced fluorescence technique in conjunction with other standard plasma diagnostics to generate a wealth of data on near-cathode plume characteristics. This will build a basis for understanding how cathode erosion will be affected when Hall thrusters are scaled towards the 1 MW goal. In collaboration with NASA's GRC and JPL, significant progress can be made in our understanding of the underlying physics which drive cathode erosion. With this understanding of cathode physics, engineers can begin to develop predictive models for cathode-thruster interactions to design long-life Hall effect thrusters which meet NASA's space exploration goals.","destinations":[{"lkuCodeId":1546,"code":"INSIDE_SOLAR_SYSTEM","description":"Others Inside the Solar System","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}},{"lkuCodeId":1518,"code":"MARS","description":"Mars","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}}],"startYear":2015,"startMonth":8,"endYear":2019,"endMonth":12,"statusDescription":"Completed","principalInvestigators":[{"contactId":8134,"firstName":"Alec","lastName":"Gallimore","fullName":"Alec Gallimore","fullNameInverted":"Gallimore, Alec","primaryEmail":"rasta@umich.edu","publicEmail":false,"nacontact":false}],"programDirectors":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programExecutives":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programManagers":[{"contactId":183514,"firstName":"Hung","lastName":"Nguyen","fullName":"Hung D Nguyen","fullNameInverted":"Nguyen, Hung D","middleInitial":"D","primaryEmail":"hung.d.nguyen@nasa.gov","publicEmail":true,"nacontact":false}],"coInvestigators":[{"contactId":304949,"firstName":"Marcel","lastName":"Georgin","fullName":"Marcel P Georgin","fullNameInverted":"Georgin, Marcel P","middleInitial":"P","publicEmail":false,"nacontact":false}],"website":"https://www.nasa.gov/strg#.VQb6T0jJzyE","libraryItems":[],"transitions":[],"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"program":{"acronym":"STRG","active":true,"description":"<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ","programId":69,"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"responsibleMdId":4875,"stockImageFileId":36658,"title":"Space Technology Research Grants"},"leadOrganization":{"canUserEdit":false,"city":"Ann Arbor","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":2900,"organizationName":"University of Michigan-Ann Arbor","organizationType":"Academia","stateTerritory":{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34},"stateTerritoryId":34,"murepUnitId":170976,"naorganization":false,"organizationTypePretty":"Academia"},"supportingOrganizations":[{"acronym":"GRC","canUserEdit":false,"city":"Cleveland","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":false,"linkCount":0,"organizationId":4860,"organizationName":"Glenn Research Center","organizationType":"NASA_Center","stateTerritory":{"abbreviation":"OH","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Ohio","stateTerritoryId":23},"stateTerritoryId":23,"naorganization":false,"organizationTypePretty":"NASA Center"}],"statesWithWork":[{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34}],"lastUpdated":"2020-5-1","releaseStatusString":"Released","endDateString":"Dec 2019","startDateString":"Aug 2015"}}