{"project":{"projectId":91529,"title":"Investigation of the Hall Effect Thruster Breathing Mode and Spoke Mode Instabilities in the Very Near Field","primaryTaxonomyNodes":[{"taxonomyNodeId":10544,"taxonomyRootId":8816,"parentNodeId":10542,"level":3,"code":"TX01.2.2","title":"Electrostatic","definition":"This area covers electric propulsion systems that use electrostatic fields to ionize and accelerate a propellant.","exampleTechnologies":"Ion engines, hall thrusters, electrospray propulsion","hasChildren":false,"hasInteriorContent":true}],"startTrl":2,"currentTrl":2,"endTrl":3,"benefits":"In-space propulsion is a major element of NASA's Technology Area Breakdown Structure (TABS), and specifically electric propulsion is a significant component of the In-Space Propulsion Systems Roadmap (ISPSR). The proposed research is therefore highly relevant in that it not only uses electric propulsion devices for a proposed investigation of plasma physics but it is intended to improve Hall thruster efficiency. In the ISPSR, two of the top three technical challenges highlighted are electric propulsion related. In particular, one of these challenges is related to high-power solar electric propulsion. The proposed research aims to explore the physics underpinning instabilities in Hall thrusters, and thus has the goal to provide new insight for next-generation Hall thruster designs. For this reason it will enable the development high-power solar Hall thruster propulsion solutions.","description":"One of the most practical forms of electric propulsion is the Hall Effect Thruster (HET), which makes use of electric and magnetic fields to create and eject a plasma. One of the most common HET designs is the stationary plasma thruster, in which an annular channel acts as an ionization zone where a radial magnetic field and axial electric field establish an electron Hall current. Despite the prevalence of this design in university and commercial settings, the physical mechanisms governing its operation are still not entirely understood.  I propose to conduct research involving time-resolved plasma measurements in the very-near field of a modern high-power Hall thruster. The goal of this research is to directly observe the variation of plasma properties in the ionization zone of a Hall thruster so as to quantitatively characterize some of the major instabilities known to occur in these devices. In doing this, the impact of these instabilities on performance can be determined, providing the insight needed to design more efficient Hall thrusters. The two main types of instabilities that I plan to examine are the spoke and breathing mode instabilities. These two turbulent effects originate in the ionization zone of a Hall thruster and generally occur with frequencies on the order of tens of kilohertz. To capture these effects in any capacity, time-resolved diagnostic tools must be employed. Although these instabilities have been examined before, there is limited data characterizing them in a time-resolved manner and virtually no existing data doing so in the very-near field. For each instability, I propose to examine its steady-state behavior, origin, and effect on thruster performance.  This research will be conducted at the Plasmadynamics and Electric Propulsion Laboratory (PEPL), where the material and personnel resources are well-suited for facilitating the proposed research. PEPL has the 6-m diameter, 9-m long cylindrical stainless steel clad Large Vacuum Test Facility, which has a pumping speed of 240,000 L/s on xenon using LN2 baffled cryopanels. To evaluate thruster efficiency, I will require diagnostic tools such as a Faraday probe, ExB probe, and retarding potential analyzer. These will allow me to measure current density profiles, current as a function of degree of ionization, and acceleration voltage. These quantities can then be used to determine various efficiencies, including mass utilization efficiency, current utilization efficiency, and divergence efficiency, as outlined by Liang and Gallimore.  For time-resolved measurements, I propose to use a high-speed dual Langmuir probe (HDLP). Technical limitations for a single Langmuir probe generally prevent it from being swept at frequencies greater than 0.01 to 70 kHz for a Hall thruster plasma. A HDLP can be used to identify time-resolved electron density, potential, and ion flux in the channel, and has been used to do so sweeping at up to 400 kHz. This represents the highest frequency full sweep data published to date, providing unheard of temporal resolution.  In-space propulsion is a major element of NASA's Technology Area Breakdown Structure (TABS), and specifically electric propulsion is a significant component of the In-Space Propulsion Systems Roadmap (ISPSR). The proposed research is therefore highly relevant in that it not only uses electric propulsion devices for a proposed investigation of plasma physics but it is intended to improve Hall thruster efficiency. In the ISPSR, two of the top three technical challenges highlighted are electric propulsion related. In particular, one of these challenges is related to high-power solar electric propulsion. The proposed research aims to explore the physics underpinning instabilities in Hall thrusters, and thus has the goal to provide new insight for next-generation Hall thruster designs. For this reason it will enable the development high-power solar Hall thruster propulsion solutions.","destinations":[{"lkuCodeId":1543,"code":"EARTH","description":"Earth","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}},{"lkuCodeId":1548,"code":"FOUNDATIONAL_KNOWLEDGE","description":"Foundational Knowledge","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}}],"startYear":2014,"startMonth":8,"endYear":2018,"endMonth":8,"statusDescription":"Completed","principalInvestigators":[{"contactId":251850,"firstName":"J. P.","lastName":"Sheehan","fullName":"J. P. Sheehan","fullNameInverted":"Sheehan, J. P.","publicEmail":false,"nacontact":false}],"programDirectors":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programExecutives":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programManagers":[{"contactId":183514,"firstName":"Hung","lastName":"Nguyen","fullName":"Hung D Nguyen","fullNameInverted":"Nguyen, Hung D","middleInitial":"D","primaryEmail":"hung.d.nguyen@nasa.gov","publicEmail":true,"nacontact":false}],"coInvestigators":[{"contactId":147185,"firstName":"Ethan","lastName":"Dale","fullName":"Ethan Dale","fullNameInverted":"Dale, Ethan","primaryEmail":"ethan.t.dale@jpl.nasa.gov","publicEmail":true,"nacontact":false}],"website":"https://www.nasa.gov/directorates/spacetech/home/index.html","libraryItems":[],"transitions":[],"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"program":{"acronym":"STRG","active":true,"description":"<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ","programId":69,"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"responsibleMdId":4875,"stockImageFileId":36658,"title":"Space Technology Research Grants"},"leadOrganization":{"canUserEdit":false,"city":"Ann Arbor","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":2900,"organizationName":"University of Michigan-Ann Arbor","organizationType":"Academia","stateTerritory":{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34},"stateTerritoryId":34,"murepUnitId":170976,"naorganization":false,"organizationTypePretty":"Academia"},"statesWithWork":[{"abbreviation":"MI","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"Michigan","stateTerritoryId":34}],"lastUpdated":"2018-10-10","releaseStatusString":"Released","endDateString":"Aug 2018","startDateString":"Aug 2014"}}