{"project":{"projectId":91582,"title":"Microfluidic Array of Externally Fed Electrospray Thrusters for Micro-Propulsion","primaryTaxonomyNodes":[{"taxonomyNodeId":10544,"taxonomyRootId":8816,"parentNodeId":10542,"level":3,"code":"TX01.2.2","title":"Electrostatic","definition":"This area covers electric propulsion systems that use electrostatic fields to ionize and accelerate a propellant.","exampleTechnologies":"Ion engines, hall thrusters, electrospray propulsion","hasChildren":false,"hasInteriorContent":true}],"startTrl":2,"currentTrl":2,"endTrl":3,"benefits":"The combination of these three attributes; scalability, precision and fuel efficiency, make electrospray thrusters perfectly suited for use on small satellites (<40 kg).  These satellites, including those in the well-known CubeSat platform, are opening the door to space research and entrepreneurship to a wide range of organizations.  The capabilities of these satellites are, however, limited as there exist few propulsion systems capable of scaling down small enough to fit on, say, a 1U (10x10x10 cm) CubeSat. Self-propelled small satellites would be more versatile than their free-floating counterparts and would be capable of formation flying, making extremely low cost, high-coverage satellite networks possible.","description":"The goal of this proposal is to design an electrospray micropropulsion thruster that utilizes a novel propellant transport mechanism.  This project is a collaboration with a group of roughly 15 scientists at the Jet Propulsion Laboratory (JPL).  If successful, our thruster will be flight tested in space within three years.  Electrospray propulsion is based on a phenomenon whereby a conductive fluid will spontaneously form sharp cones when in the presence of an electric field.  These stable protrusions are commonly referred to as Taylor Cones, after the scientist that described their material-independent geometry.  Depending on fluid and field conditions, droplets of liquid or individual ions may be emitted from the tip of a Taylor Cone, producing a self-sustaining stream of charged particles.  This technology has been applied to printer heads, material synthesis and propulsion.  Electrospray propulsion has been a subject of research for several decades.  It is an extremely attractive technology for three main reasons.  First, it is highly scalable as the non-volatile liquid propellant used obviates the need for the robust plumbing required by chemical propulsion systems or Hall thrusters.  Since emitted particles are accelerated linearly, they require no nozzle to redirect flow, further reducing the thruster's footprint.  Secondly, the thrusters are capable of producing very precise thrust resolution due to the small mass of the emitted ions and the fact that the electrospray process is controlled completely electronically.  The final benefit is the spectacularly high exhaust velocity that these systems can produce.  The exhaust velocity of a chemical propellant is limited by the specific energy release of the chosen chemical reaction but electrosprayed ions can be accelerated to arbitrarily high velocities.  Electrospray exhaust velocities can easily surpass those of chemical thrusters by an order of magnitude.  Exhaust velocity is proportional to specific impulse, an important thruster characteristic that describes the fuel consumption rate required to produce a given thrust.  The combination of these three attributes; scalability, precision and fuel efficiency, make electrospray thrusters perfectly suited for use on small satellites (<40 kg).  These satellites, including those in the well-known CubeSat platform, are opening the door to space research and entrepreneurship to a wide range of organizations.  The capabilities of these satellites are, however, limited as there exist few propulsion systems capable of scaling down small enough to fit on, say, a 1U (10x10x10 cm) CubeSat. Self-propelled small satellites would be more versatile than their free-floating counterparts and would be capable of formation flying, making extremely low cost, high-coverage satellite networks possible.  Though Taylor Cones will readily form on a flat fluid surface, it is preferable to localize the emitting area by placing the fluid at the tip of a sharp protrusion.  This also decreases the electric potential required to produce emission, as the sharp convex tip will enhance the local electric field.  The majority of electrospray propulsion devices achieve this using small, hollow needles.  This internal flow presents a limit to scalability, as microscopic needles are prone to clogging and require high pressure to produce the flux required to sustain emission.  The aim of this proposal is to design an array of externally-fed electrospray emitters, including the bulk emitter shape and the micropatterned surfaces of both the emitter and the planar substrate on which they are placed.  By selectively patterning the surfaces with grooves and channels of yet to be determined geometries, the flow of liquid can be precisely controlled without any active pumping or actuation.  This project will require first principle derivation of free surface fluid flow governing equations in model geometries and subsequent numerical modeling.","destinations":[{"lkuCodeId":1543,"code":"EARTH","description":"Earth","lkuCodeTypeId":526,"lkuCodeType":{"codeType":"DESTINATION_TYPE","description":"Destination Type"}}],"startYear":2014,"startMonth":9,"endYear":2018,"endMonth":9,"statusDescription":"Completed","principalInvestigators":[{"contactId":422859,"firstName":"Sandra","lastName":"Troian","fullName":"Sandra M Troian","fullNameInverted":"Troian, Sandra M","middleInitial":"M","publicEmail":false,"nacontact":false}],"programDirectors":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programExecutives":[{"contactId":84634,"firstName":"Claudia","lastName":"Meyer","fullName":"Claudia M Meyer","fullNameInverted":"Meyer, Claudia M","middleInitial":"M","primaryEmail":"claudia.m.meyer@nasa.gov","publicEmail":true,"nacontact":false}],"programManagers":[{"contactId":183514,"firstName":"Hung","lastName":"Nguyen","fullName":"Hung D Nguyen","fullNameInverted":"Nguyen, Hung D","middleInitial":"D","primaryEmail":"hung.d.nguyen@nasa.gov","publicEmail":true,"nacontact":false}],"coInvestigators":[{"contactId":460701,"firstName":"Theodore","lastName":"Albertson","fullName":"Theodore G Albertson","fullNameInverted":"Albertson, Theodore G","middleInitial":"G","publicEmail":false,"nacontact":false}],"website":"https://www.nasa.gov/directorates/spacetech/home/index.html","libraryItems":[],"transitions":[],"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"program":{"acronym":"STRG","active":true,"description":"<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ","programId":69,"responsibleMd":{"acronym":"STMD","canUserEdit":false,"city":"","external":false,"linkCount":0,"organizationId":4875,"organizationName":"Space Technology Mission Directorate","organizationType":"NASA_Mission_Directorate","naorganization":false,"organizationTypePretty":"NASA Mission Directorate"},"responsibleMdId":4875,"stockImageFileId":36658,"title":"Space Technology Research Grants"},"leadOrganization":{"acronym":"CalTech","canUserEdit":false,"city":"Pasadena","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"external":true,"linkCount":0,"organizationId":3115,"organizationName":"California Institute of Technology","organizationType":"Academia","stateTerritory":{"abbreviation":"CA","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"California","stateTerritoryId":59},"stateTerritoryId":59,"murepUnitId":110404,"naorganization":false,"organizationTypePretty":"Academia"},"statesWithWork":[{"abbreviation":"CA","country":{"abbreviation":"US","countryId":236,"name":"United States"},"countryId":236,"name":"California","stateTerritoryId":59}],"lastUpdated":"2018-10-10","releaseStatusString":"Released","endDateString":"Sep 2018","startDateString":"Sep 2014"}}